projectFiles/bentPipe/Re100/q-500/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    heatWall
    {
     	type            compressible::alphatJayatillekeWallFunction;
        Prt             0.85;
        value           uniform 0;   
    }
    wall
    {
     	type            compressible::alphatJayatillekeWallFunction;
        Prt             0.85;
        value           uniform 0; 
    }
    outlet
    {
	type            calculated;
        value           uniform 0;
    }

    inlet
    {
       type            calculated;
       value           uniform 0;
    }
}


// ************************************************************************* //
